In [ ]:
import os
import pandas as pd
import numpy

In [ ]:
print(os.getcwd())
os.chdir('E:/Data Science _TR/Datasets')
print(os.getcwd())

In [ ]:
df= pd.read_csv('Diabetes_Miss.csv')
df.head(3)

In [ ]:
df.shape

In [ ]:
df.head()

In [ ]:
df.isnull().any()

In [ ]:
df= pd.read_csv('Churn_Modelling.csv')
df.head(3)

In [ ]:
df.isna().sum()

In [ ]:
df= pd.read_csv('Diabetes_Miss.csv')
df.head(3)

In [ ]:
df.shape

In [ ]:
df.isnull().sum()

In [ ]:
df = df.dropna()
df.shape

In [ ]:
print(df2.isna().sum())
print(df2.shape)

In [ ]:
print(df.isna().sum())
print(df.shape)

In [ ]:
df.isnull().sum()

In [ ]:
df.isna().sum()

In [ ]:
df3=df.fillna('999')

In [ ]:
df3.isna().sum()

In [ ]:
df3.shape

In [ ]:
df= pd.read_csv('Diabetes_Miss.csv')
df.head(3)

In [ ]:
df.isna().sum()

In [ ]:
df= df.fillna(df.mean())

In [ ]:
df

In [75]:
df = pd.DataFrame([['Ajitesh', 'M', 95, 89, 84],
                  ['Sanjiv', 'M', 90,None,87],
                  ['Rita', None,99,78,None],
                  ['Sangeeta', 'F',None,82,71],
                  ['Raju','M',None,75,81],
                  ['Srinivas','M',90,None,76]])
df

          0     1     2     3     4
0   Ajitesh     M  95.0  89.0  84.0
1    Sanjiv     M  90.0   NaN  87.0
2      Rita  None  99.0  78.0   NaN
3  Sangeeta     F   NaN  82.0  71.0
4      Raju     M   NaN  75.0  81.0
5  Srinivas     M  90.0   NaN  76.0

In [76]:
df.isnull().sum()

0    0
1    1
2    2
3    2
4    1
dtype: int64

In [77]:
df.describe().T

   count  mean       std   min    25%   50%    75%   max
2    4.0  93.5  4.358899  90.0  90.00  92.5  96.00  99.0
3    4.0  81.0  6.055301  75.0  77.25  80.0  83.75  89.0
4    5.0  79.8  6.379655  71.0  76.00  81.0  84.00  87.0

In [87]:
df

          0     1     2     3     4
0   Ajitesh     M  95.0  89.0  84.0
1    Sanjiv     M  90.0   NaN  87.0
2      Rita  None  99.0  78.0   NaN
3  Sangeeta     F   NaN  82.0  71.0
4      Raju     M   NaN  75.0  81.0
5  Srinivas     M  90.0   NaN  76.0

In [88]:
df.mean()

C:\Users\HP\AppData\Local\Temp/ipykernel_6996/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

2    93.5
3    81.0
4    79.8
dtype: float64

In [79]:
df.median()

C:\Users\HP\AppData\Local\Temp/ipykernel_6996/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

2    92.5
3    80.0
4    81.0
dtype: float64

In [80]:
df.mode()

          0    1     2     3     4
0   Ajitesh    M  90.0  75.0  71.0
1      Raju  NaN   NaN  78.0  76.0
2      Rita  NaN   NaN  82.0  81.0
3  Sangeeta  NaN   NaN  89.0  84.0
4    Sanjiv  NaN   NaN   NaN  87.0
5  Srinivas  NaN   NaN   NaN   NaN

In [72]:
df

          0  1     2     3     4
0   Ajitesh  M  95.0  89.0  84.0
1    Sanjiv  M  90.0   NaN  87.0
2      None  F  99.0  78.0   NaN
3  Sangeeta  F   NaN  82.0  71.0
4      Raju  M   NaN  75.0  81.0
5  Srinivas  M  90.0   NaN  76.0

In [85]:
df2= df.fillna(df.mode())

In [86]:
df2

          0    1     2     3     4
0   Ajitesh    M  95.0  89.0  84.0
1    Sanjiv    M  90.0  78.0  87.0
2      Rita  NaN  99.0  78.0  81.0
3  Sangeeta    F   NaN  82.0  71.0
4      Raju    M   NaN  75.0  81.0
5  Srinivas    M  90.0   NaN  76.0

In [58]:
df2

          0  1     2     3     4
0   Ajitesh  M  95.0  89.0  84.0
1    Sanjiv  M  90.0  80.0  87.0
2      Rita  F  99.0  78.0  81.0
3  Sangeeta  F  92.5  82.0  71.0
4      Raju  M  92.5  75.0  81.0
5  Srinivas  M  90.0  80.0  76.0

In [61]:
df

          0  1     2     3     4
0   Ajitesh  M  95.0  89.0  84.0
1    Sanjiv  M  90.0   NaN  87.0
2      Rita  F  99.0  78.0   NaN
3  Sangeeta  F   NaN  82.0  71.0
4      Raju  M   NaN  75.0  81.0
5  Srinivas  M  90.0   NaN  76.0

In [64]:
df.describe().T

   count  mean       std   min    25%   50%    75%   max
2    4.0  93.5  4.358899  90.0  90.00  92.5  96.00  99.0
3    4.0  81.0  6.055301  75.0  77.25  80.0  83.75  89.0
4    5.0  79.8  6.379655  71.0  76.00  81.0  84.00  87.0

In [ ]:
df2.describe().T

In [ ]:
df2

In [ ]:
df2

In [ ]:
df

In [ ]:
df3= df.fillna(df.mode())

In [ ]:
df3

In [ ]:
df

In [ ]:
df.mean()

In [ ]:
df.median()

In [ ]:
df

In [ ]:
df.mode()